In [1]:
import pandas as pd

In [11]:
import mysql.connector

In [18]:
import sqlalchemy as sqlal

In [17]:
# connect mysql dengan URL

alamatDB = "mysql://root:@localhost:3306/test"
q = "select * from employees"
df  = pd.read_sql(q, alamatDB)
df

   id      nama                       email               waktu
0   1     nadia  nadia.ningtias20@Gmail.com 2019-12-09 09:28:25
1   2  ningtias        ningtias20@Gmail.com 2019-12-09 09:28:45
2   3      maya              maya@gmail.com 2019-12-09 09:29:11
3   4    jokowi            jokowi@gmail.com 2019-12-09 09:29:35

In [9]:
# connect mysql dengan param

mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "",
    database = "test"
)

q = "select * from employees"
df = pd.read_sql(q, mydb)
df

   id      nama                       email               waktu
0   1     nadia  nadia.ningtias20@Gmail.com 2019-12-09 09:28:25
1   2  ningtias        ningtias20@Gmail.com 2019-12-09 09:28:45
2   3      maya              maya@gmail.com 2019-12-09 09:29:11
3   4    jokowi            jokowi@gmail.com 2019-12-09 09:29:35

In [10]:
df.dtypes

id                int64
nama             object
email            object
waktu    datetime64[ns]
dtype: object

In [42]:
engine = sqlal.create_engine(
    alamatDB
)
q = "select * from employees"
df = pd.read_sql(q, engine)
df

   id      nama                       email               waktu
0   1     nadia  nadia.ningtias20@Gmail.com 2019-12-09 09:28:25
1   2  ningtias        ningtias20@Gmail.com 2019-12-09 09:28:45
2   3      maya              maya@gmail.com 2019-12-09 09:29:11
3   4    jokowi            jokowi@gmail.com 2019-12-09 09:29:35

In [24]:
df1 = pd.read_sql('employees', engine, columns=['email'])
df1

                        email
0            jokowi@gmail.com
1              maya@gmail.com
2  nadia.ningtias20@Gmail.com
3        ningtias20@Gmail.com

In [44]:
# CREATE - insert dataframe into table

df.to_sql(
    name = 'daftarkaryawan3', # harus lowercase 
    con = engine,
    if_exists = 'replace' # bisa 'fail', 'replace', 'append'
)

In [45]:
engine = sqlal.create_engine(
    alamatDB
)
q = "select * from daftarkaryawan3"
df = pd.read_sql(q, engine)
df

   index  id      nama                       email               waktu
0      0   1     nadia  nadia.ningtias20@Gmail.com 2019-12-09 09:28:25
1      1   2  ningtias        ningtias20@Gmail.com 2019-12-09 09:28:45
2      2   3      maya              maya@gmail.com 2019-12-09 09:29:11
3      3   4    jokowi            jokowi@gmail.com 2019-12-09 09:29:35

In [53]:
newData=pd.DataFrame([
    {
        'id' : 5, 'nama' : 'Saddil',
        'email' : 'saddil@gmail.com',
        'waktu' : '2019-12-10 10:22:31'
    }
])

In [57]:

# newData['waktu'] = newData['waktu'].astype('datetime64')
newData.dtypes

df2 = pd.concat([df, newData], ignore_index=True)
df2
df2.dtypes

email            object
id                int64
index           float64
nama             object
waktu    datetime64[ns]
dtype: object